; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	thermograph4 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	infrared2 - mode
	image3 - mode
	star2 - direction
	groundstation3 - direction
	groundstation1 - direction
	groundstation4 - direction
	star0 - direction
	phenomenon5 - direction
	phenomenon6 - direction
	star7 - direction
	phenomenon8 - direction
	phenomenon9 - direction
	planet10 - direction
	star11 - direction
	phenomenon12 - direction
	planet13 - direction
	star14 - direction
	phenomenon15 - direction
	star16 - direction
	star17 - direction
	star18 - direction
	phenomenon19 - direction
	star20 - direction
	planet21 - direction
	planet22 - direction
	star23 - direction
	phenomenon24 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 star2)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(supports instrument1 image3)
	(calibration_target instrument1 groundstation3)
	(supports instrument2 spectrograph0)
	(supports instrument2 image3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 phenomenon12)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 star2)
	(supports instrument4 image3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 phenomenon24)
	(supports instrument5 image3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 groundstation3)
	(supports instrument6 spectrograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 groundstation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 phenomenon5)
	(supports instrument7 image3)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 groundstation1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 groundstation1)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared2)
	(calibration_target instrument9 groundstation1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 phenomenon24)
	(supports instrument10 spectrograph0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 groundstation4)
	(supports instrument11 spectrograph1)
	(supports instrument11 infrared2)
	(supports instrument11 spectrograph0)
	(calibration_target instrument11 groundstation1)
	(supports instrument12 spectrograph0)
	(calibration_target instrument12 star0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 star11)
	(supports instrument13 infrared2)
	(supports instrument13 spectrograph1)
	(supports instrument13 spectrograph0)
	(calibration_target instrument13 groundstation4)
	(supports instrument14 image3)
	(calibration_target instrument14 star0)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 star14)
)
(:goal (and
	(pointing satellite1 groundstation4)
	(pointing satellite4 phenomenon24)
	(pointing satellite5 groundstation1)
	(have_image phenomenon5 image3)
	(have_image phenomenon6 infrared2)
	(have_image star7 image3)
	(have_image phenomenon8 spectrograph1)
	(have_image phenomenon9 infrared2)
	(have_image planet10 spectrograph0)
	(have_image phenomenon12 infrared2)
	(have_image star14 image3)
	(have_image phenomenon15 image3)
	(have_image star16 thermograph4)
	(have_image star17 spectrograph1)
	(have_image phenomenon19 infrared2)
	(have_image star20 spectrograph0)
	(have_image planet21 spectrograph0)
	(have_image planet22 spectrograph0)
	(have_image star23 spectrograph1)
))

)

; plan
1. (switch_on instrument13 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument13)
   goals met: 0 of 19
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 19
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 19
4. (turn_to satellite5 groundstation1 star14)
   deleted: (pointing satellite5 star14)
   added: (pointing satellite5 groundstation1)
   goals met: 1 of 19
5. (turn_to satellite4 phenomenon24 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 phenomenon24)
   goals met: 2 of 19
6. (turn_to satellite1 groundstation4 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 groundstation4)
   goals met: 3 of 19
7. (turn_to satellite0 phenomenon15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 19
8. (turn_to satellite5 groundstation4 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 groundstation4)
   goals met: 2 of 19
9. (calibrate satellite5 instrument13 groundstation4)
   added: (calibrated instrument13)
   goals met: 2 of 19
10. (turn_to satellite5 groundstation1 groundstation4)
   deleted: (pointing satellite5 groundstation4)
   added: (pointing satellite5 groundstation1)
   goals met: 3 of 19
11. (turn_to satellite0 star2 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star2)
   goals met: 3 of 19
12. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 3 of 19
13. (turn_to satellite0 phenomenon15 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 19
14. (take_image satellite0 phenomenon15 instrument0 image3)
   added: (have_image phenomenon15 image3)
   goals met: 4 of 19
15. (turn_to satellite0 phenomenon5 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 19
16. (take_image satellite0 phenomenon5 instrument0 image3)
   added: (have_image phenomenon5 image3)
   goals met: 5 of 19
17. (turn_to satellite0 star14 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star14)
   goals met: 5 of 19
18. (take_image satellite0 star14 instrument0 image3)
   added: (have_image star14 image3)
   goals met: 6 of 19
19. (turn_to satellite0 star16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star16)
   goals met: 6 of 19
20. (take_image satellite0 star16 instrument0 thermograph4)
   added: (have_image star16 thermograph4)
   goals met: 7 of 19
21. (turn_to satellite0 star7 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star7)
   goals met: 7 of 19
22. (take_image satellite0 star7 instrument0 image3)
   added: (have_image star7 image3)
   goals met: 8 of 19
23. (turn_to satellite5 phenomenon12 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon12)
   goals met: 7 of 19
24. (take_image satellite5 phenomenon12 instrument13 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 8 of 19
25. (turn_to satellite5 groundstation1 phenomenon12)
   deleted: (pointing satellite5 phenomenon12)
   added: (pointing satellite5 groundstation1)
   goals met: 9 of 19
26. (turn_to satellite5 phenomenon19 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon19)
   goals met: 8 of 19
27. (take_image satellite5 phenomenon19 instrument13 infrared2)
   added: (have_image phenomenon19 infrared2)
   goals met: 9 of 19
28. (turn_to satellite5 groundstation1 phenomenon19)
   deleted: (pointing satellite5 phenomenon19)
   added: (pointing satellite5 groundstation1)
   goals met: 10 of 19
29. (turn_to satellite5 phenomenon6 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon6)
   goals met: 9 of 19
30. (take_image satellite5 phenomenon6 instrument13 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 10 of 19
31. (turn_to satellite5 groundstation1 phenomenon6)
   deleted: (pointing satellite5 phenomenon6)
   added: (pointing satellite5 groundstation1)
   goals met: 11 of 19
32. (turn_to satellite5 phenomenon8 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon8)
   goals met: 10 of 19
33. (take_image satellite5 phenomenon8 instrument13 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 11 of 19
34. (turn_to satellite5 groundstation1 phenomenon8)
   deleted: (pointing satellite5 phenomenon8)
   added: (pointing satellite5 groundstation1)
   goals met: 12 of 19
35. (turn_to satellite5 phenomenon9 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon9)
   goals met: 11 of 19
36. (take_image satellite5 phenomenon9 instrument13 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 12 of 19
37. (turn_to satellite5 groundstation1 phenomenon9)
   deleted: (pointing satellite5 phenomenon9)
   added: (pointing satellite5 groundstation1)
   goals met: 13 of 19
38. (turn_to satellite5 planet10 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 planet10)
   goals met: 12 of 19
39. (take_image satellite5 planet10 instrument13 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 13 of 19
40. (turn_to satellite5 groundstation1 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 groundstation1)
   goals met: 14 of 19
41. (turn_to satellite5 planet21 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 planet21)
   goals met: 13 of 19
42. (take_image satellite5 planet21 instrument13 spectrograph0)
   added: (have_image planet21 spectrograph0)
   goals met: 14 of 19
43. (turn_to satellite5 groundstation1 planet21)
   deleted: (pointing satellite5 planet21)
   added: (pointing satellite5 groundstation1)
   goals met: 15 of 19
44. (turn_to satellite5 planet22 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 planet22)
   goals met: 14 of 19
45. (take_image satellite5 planet22 instrument13 spectrograph0)
   added: (have_image planet22 spectrograph0)
   goals met: 15 of 19
46. (turn_to satellite5 groundstation1 planet22)
   deleted: (pointing satellite5 planet22)
   added: (pointing satellite5 groundstation1)
   goals met: 16 of 19
47. (turn_to satellite5 star17 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 star17)
   goals met: 15 of 19
48. (take_image satellite5 star17 instrument13 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 16 of 19
49. (turn_to satellite5 groundstation1 star17)
   deleted: (pointing satellite5 star17)
   added: (pointing satellite5 groundstation1)
   goals met: 17 of 19
50. (turn_to satellite5 star20 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 star20)
   goals met: 16 of 19
51. (take_image satellite5 star20 instrument13 spectrograph0)
   added: (have_image star20 spectrograph0)
   goals met: 17 of 19
52. (turn_to satellite5 groundstation1 star20)
   deleted: (pointing satellite5 star20)
   added: (pointing satellite5 groundstation1)
   goals met: 18 of 19
53. (turn_to satellite5 star23 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 star23)
   goals met: 17 of 19
54. (take_image satellite5 star23 instrument13 spectrograph1)
   added: (have_image star23 spectrograph1)
   goals met: 18 of 19
55. (turn_to satellite5 groundstation1 star23)
   deleted: (pointing satellite5 star23)
   added: (pointing satellite5 groundstation1)
   goals met: 19 of 19
